ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g518x/TINIELITE_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="TINIELITE" HW_revision="1.0">
    <group id="TINIELITE_GPRCM" name="TINIELITE_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="TINIELITE_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="TINIELITE_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="TINIELITE_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
        </group>
    <group id="TINIELITE_INT_EVENT[J]" name="TINIELITE_INT_EVENT[J]" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="TINIELITE_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="DONE" value="0x1" description="Done indication interrupt"/>
            </bitfield>
        </register>
        <register id="TINIELITE_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DONE" description="DONE interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
        <register id="TINIELITE_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DONE" description="DONE interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
        <register id="TINIELITE_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DONE" description="DONE interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
        <register id="TINIELITE_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DONE" description="DONE interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
        <register id="TINIELITE_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DONE" description="DONE interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Disable Event"/>
                <bitenum id="SET" value="0x1" description="Enable Event"/>
            </bitfield>
        </register>
        </group>
    <register id="TINIELITE_EVT_MODE" width="32" offset="0x10E0" description="'Event Mode'">
        <bitfield id="INT0_CFG" description="'Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT][0]'" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="&amp;apos;The interrupt or event line is disabled.&amp;apos;"/>
            <bitenum id="SOFTWARE" value="0x1" description="&amp;apos;The interrupt or event line is in software mode. Software must clear the RIS.&amp;apos;"/>
            <bitenum id="HARDWARE" value="0x2" description="&amp;apos;The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag.&amp;apos;"/>
        </bitfield>
    </register>
    <register id="TINIELITE_DESC" width="32" offset="0x10FC" description="Module Description Register">
        <bitfield id="MODULEID" description="specifies module id" begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="specifies feature version info" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="INSTNUM" description="specifies module instance number" begin="11" end="8" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="specifies major revision id" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MINREV" description="specifies minor revision id" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
    <register id="TINIELITE_CTL5" width="32" offset="0x1120" description="CTL5 register">
        <bitfield id="RUN" description="Start the accelerator. Writing a 1 to this bit starts the accelerator. When the STOP instruction is executed this bit is cleared by hardware and DONE interrupt flag is set." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ENIFMAPCIRC" description="Enable circular addressing on input feature map read address." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description=""/>
            <bitenum id="ENABLE" value="0x1" description="Enable circular buffering on the input feature map"/>
        </bitfield>
        <bitfield id="ENOFMAPCIRC" description="Enable circular addressing on output feature map read address." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable circular buffering on the output feature map"/>
            <bitenum id="ENABLE" value="0x1" description="Enable circular buffering on the output feature map"/>
        </bitfield>
    </register>
    <register id="TINIELITE_CTL4" width="32" offset="0x1124" description="">
        <bitfield id="OFMAPCIRSTART" description="Circular buffer output feature map start address." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="OFMAPCIREND" description="Circular buffer output feature map end address." begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="TINIELITE_CTL3" width="32" offset="0x1128" description="">
        <bitfield id="IFMAPCIRSTART" description="Circular buffer input feature map start address" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="IFMAPCIREND" description="Circular buffer input feature map end address" begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="TINIELITE_CTL2" width="32" offset="0x112C" description="CTL2 register">
        <bitfield id="CLLOW" description="Lower clamp value" begin="8" end="0" width="9" rwaccess="R/W">
        </bitfield>
        <bitfield id="CLHIGH" description="Upper clamp value" begin="24" end="16" width="9" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="TINIELITE_CTL1" width="32" offset="0x1130" description="CTL1 register">
        <bitfield id="IFMAPSTARTHI" description="Start address (Higher 16 bits) of input feature map data." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
        <bitfield id="OFMAPSTARTHI" description="Start address (Higher 16 bits) of output feature map data." begin="31" end="16" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="TINIELITE_CTL0" width="32" offset="0x1134" description="CTL0 register">
        <bitfield id="WTYPE" description="Weight Type" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="_2T" value="0x0" description="+1,-1,0"/>
            <bitenum id="BINARY" value="0x1" description="Binary data type, +1 or -1"/>
            <bitenum id="SIGNED_2BIT" value="0x2" description="Unsigned 8 bit data type"/>
            <bitenum id="SIGNED_4BIT" value="0x3" description="Signed 4 bit data type"/>
            <bitenum id="SIGNED_8BIT" value="0x4" description="Signed 8 bit data type"/>
        </bitfield>
        <bitfield id="IFMAPTYPE" description="Input feature map type," begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="UNSIGNED_16BIT" value="0x0" description=""/>
            <bitenum id="UNSIGNED_8BIT" value="0x1" description="Unsigned 8 bit data type"/>
            <bitenum id="UNSIGNED_4BIT" value="0x2" description="Unsigned 4 bit data type"/>
            <bitenum id="BINARY" value="0x3" description="Binary data type"/>
            <bitenum id="SIGNED_16BIT" value="0x8" description=""/>
            <bitenum id="SIGNED_8BIT" value="0x9" description="Signed 8 bit data type"/>
            <bitenum id="SIGNED_4BIT" value="0xA" description="Signed 4 bit data type"/>
        </bitfield>
        <bitfield id="OFMAPTYPE" description="Output feature map type." begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="UNSIGNED_16BIT" value="0x0" description=""/>
            <bitenum id="UNSIGNED_8BIT" value="0x1" description="Unsigned 8 bit data type"/>
            <bitenum id="UNSIGNED_4BIT" value="0x2" description="Unsigned 4 bit data type"/>
            <bitenum id="BINARY" value="0x3" description="Binary data type"/>
            <bitenum id="SIGNED_16BIT" value="0x8" description=""/>
            <bitenum id="SIGNED_8BIT" value="0x9" description="Signed 8 bit data type"/>
            <bitenum id="SIGNED_4BIT" value="0xA" description="Signed 4 bit data type"/>
        </bitfield>
        <bitfield id="LAYERTYPE" description="Layer type" begin="24" end="20" width="5" rwaccess="R/W">
            <bitenum id="FCONV" value="0x0" description=""/>
            <bitenum id="DW" value="0x2" description=""/>
            <bitenum id="PW" value="0x3" description=""/>
            <bitenum id="CONV" value="0x5" description=""/>
            <bitenum id="FC" value="0x6" description=""/>
            <bitenum id="AVGPOOL" value="0x7" description=""/>
            <bitenum id="MAXPOOL" value="0x8" description=""/>
            <bitenum id="FCONV_RESIDUAL" value="0x10" description=""/>
            <bitenum id="DW_RESIDUAL" value="0x12" description=""/>
            <bitenum id="PW_RESIDUAL" value="0x13" description=""/>
            <bitenum id="CONV_RESIDUAL" value="0x15" description=""/>
            <bitenum id="FC_RESIDUAL" value="0x16" description=""/>
            <bitenum id="AVGPOOL_RESIDUAL" value="0x17" description=""/>
            <bitenum id="MAXPOOL_RESIDUAL" value="0x18" description=""/>
        </bitfield>
        <bitfield id="RESIFMAPTYPE" description="Residual Input feature map type," begin="29" end="26" width="4" rwaccess="R/W">
            <bitenum id="UNSIGNED_16BIT" value="0x0" description=""/>
            <bitenum id="UNSIGNED_8BIT" value="0x1" description="Unsigned 8 bit data type"/>
            <bitenum id="UNSIGNED_4BIT" value="0x2" description="Unsigned 4 bit data type"/>
            <bitenum id="SIGNED_16BIT" value="0x8" description=""/>
            <bitenum id="SIGNED_8BIT" value="0x9" description="Signed 8 bit data type"/>
            <bitenum id="SIGNED_4BIT" value="0xA" description="Signed 4 bit data type"/>
        </bitfield>
    </register>
    <group id="TINIELITE_LCREG" name="TINIELITE_LCREG" instances="1" offset="0x1138" instaddr="0x18" description="">
        <register id="TINIELITE_LC" width="32" offset="0x0" instances="6" instaddr="0x4" description="Loop count registers.">
            <bitfield id="CNT" description="Loop count." begin="15" end="0" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        </group>
    <register id="TINIELITE_PC" width="32" offset="0x1150" description="Program count register">
        <bitfield id="VALUE" description="Program count value." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <group id="TINIELITE_ADDRREG" name="TINIELITE_ADDRREG" instances="1" offset="0x1154" instaddr="0x100" description="">
        <register id="TINIELITE_AREG" width="32" offset="0x0" instances="20" instaddr="0x4" description="Address registers.">
            <bitfield id="DATA" description="Data word." begin="15" end="0" width="16" rwaccess="R/W">
            </bitfield>
        </register>
        </group>
    <register id="TINIELITE_DATAIN" width="32" offset="0x1710" instances="2" instaddr="0x4" description="Input Data registers, used to load data from memory.">
    </register>
    <register id="TINIELITE_DATAOUT" width="32" offset="0x1720" description="Output Data registers, used to store data to memory.">
    </register>
    <register id="TINIELITE_SS0LOW" width="32" offset="0x1730" description="Scale and shift register 0, lower 32 bits.">
    </register>
    <register id="TINIELITE_SS0HIGH" width="32" offset="0x1734" description="Scale and shift register 0, upper 32 bits.">
    </register>
    <register id="TINIELITE_SS1LOW" width="32" offset="0x1738" description="Scale and shift register 1, lower 32 bits.">
    </register>
    <register id="TINIELITE_SS1HIGH" width="32" offset="0x173C" description="Scale and shift register 1, upper 32 bits.">
    </register>
    <register id="TINIELITE_WGHT0LOW" width="32" offset="0x1750" description="Weight register 0, lower 32 bits.">
    </register>
    <register id="TINIELITE_WGHT0HIGH" width="32" offset="0x1754" description="Weight register 0, upper 32 bits.">
    </register>
    <register id="TINIELITE_WGHT1LOW" width="32" offset="0x1758" description="Weight register 1, lower 32 bits.">
    </register>
    <register id="TINIELITE_WGHT1HIGH" width="32" offset="0x175C" description="Weight register 1, upper 32 bits.">
    </register>
    <group id="TINIELITE_ACCREG" name="TINIELITE_ACCREG" instances="1" offset="0x1C00" instaddr="0x200" description="">
        <register id="TINIELITE_ACCVAL" width="32" offset="0x0" instances="32" instaddr="0x4" description="Register file data.">
            <bitfield id="DATA" description="Data word." begin="17" end="0" width="18" rwaccess="R/W">
            </bitfield>
        </register>
        </group>
    <group id="TINIELITE_INSTMEM" name="TINIELITE_INSTMEM" instances="1" offset="0x2000" instaddr="0x400" description="">
        <register id="TINIELITE_INSTMEM_INSTMEM" width="32" offset="0x0" instances="256" instaddr="0x4" description="Instruction memory word.">
        </register>
        </group>
    <group id="TINIELITE_REGFILE" name="TINIELITE_REGFILE" instances="1" offset="0x2800" instaddr="0x800" description="">
        <register id="TINIELITE_RFDATA" width="32" offset="0x0" instances="512" instaddr="0x4" description="Register file data.">
        </register>
        </group>

</module>